In [1]:
from google.colab import drive

drive.mount('/content/gdrive',force_remount=True)

Mounted at /content/gdrive

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [31]:
tags = pd.read_csv('/content/gdrive/MyDrive/Company.csv')

In [32]:
tags

  ticker_symbol company_name
0          AAPL        apple
1          GOOG   Google Inc
2         GOOGL   Google Inc
3          AMZN   Amazon.com
4          TSLA    Tesla Inc
5          MSFT    Microsoft

In [33]:
data = pd.read_csv('/content/gdrive/MyDrive/CompanyValues.csv')

In [34]:
data.head()

  ticker_symbol    day_date  close_value  ...  open_value  high_value  low_value
0          AAPL  2020-05-29       317.94  ...      319.25      321.15     316.47
1          AAPL  2020-05-28       318.25  ...      316.77      323.44     315.63
2          AAPL  2020-05-27       318.11  ...      316.14      318.71     313.09
3          AAPL  2020-05-26       316.73  ...      323.50      324.24     316.50
4          AAPL  2020-05-22       318.89  ...      315.77      319.23     315.35

[5 rows x 7 columns]

In [35]:
data = data[data['day_date']>='2019-01-01']
data = data[data['day_date']<='2019-12-31']

In [36]:
#change company here
data = data[data['ticker_symbol']=='AAPL']

In [37]:
len(data)

365

In [38]:
data.head()

    ticker_symbol    day_date  close_value  ...  open_value  high_value  low_value
103          AAPL  2019-12-31       293.65  ...      289.93      293.68   289.5200
104          AAPL  2019-12-30       291.52  ...      289.46      292.69   285.2200
105          AAPL  2019-12-27       289.80  ...      291.12      293.97   288.1200
106          AAPL  2019-12-26       289.91  ...      284.82      289.98   284.7000
107          AAPL  2019-12-24       284.27  ...      284.69      284.89   282.9197

[5 rows x 7 columns]

In [39]:
company_tweet = pd.read_csv('/content/gdrive/MyDrive/Company_Tweet.csv')

In [40]:
tweets = pd.read_csv('/content/gdrive/MyDrive/Tweet.csv')

In [41]:
import datetime

tweets['day_date'] = pd.to_datetime(tweets['post_date'],unit='s').dt.strftime('%Y-%m-%d')

In [42]:
tweets = tweets[tweets['day_date']>='2019-01-01']

In [43]:
tweets.head()

                    tweet_id           writer  ...  like_num    day_date
2958419  1079890068867817473       evdefender  ...        82  2019-01-01
2958420  1079890105282842629  ExactOptionPick  ...         0  2019-01-01
2958421  1079890627335213057   traderDanielle  ...         3  2019-01-01
2958422  1079890718326431745          O__rust  ...         0  2019-01-01
2958423  1079890782742503424     GunGermSteel  ...         1  2019-01-01

[5 rows x 8 columns]

In [44]:
tweets_data = pd.merge(tweets,company_tweet,on=['tweet_id'])

In [45]:
tweets_data.head()

              tweet_id           writer  ...    day_date ticker_symbol
0  1079890068867817473       evdefender  ...  2019-01-01          TSLA
1  1079890105282842629  ExactOptionPick  ...  2019-01-01         GOOGL
2  1079890627335213057   traderDanielle  ...  2019-01-01         GOOGL
3  1079890718326431745          O__rust  ...  2019-01-01          TSLA
4  1079890782742503424     GunGermSteel  ...  2019-01-01          TSLA

[5 rows x 9 columns]

In [46]:
#change company here
tweets_apple = tweets_data[tweets_data['ticker_symbol']=='AAPL']

In [47]:
tweets_apple.head()

               tweet_id        writer  ...    day_date ticker_symbol
12  1079893136095080448           NaN  ...  2019-01-01          AAPL
13  1079893244417269762   MacHashNews  ...  2019-01-01          AAPL
16  1079895205795545089  permabear_uk  ...  2019-01-01          AAPL
17  1079895231523364864  AlpacaAlerts  ...  2019-01-01          AAPL
22  1079896178941136897    SunDog8259  ...  2019-01-01          AAPL

[5 rows x 9 columns]

In [48]:
tweets_metrics = tweets_apple[['day_date', 'comment_num', 'retweet_num', 'like_num']]
tweets_metrics = tweets_metrics.groupby(["day_date"]).agg({'comment_num':'sum'})

In [49]:
len(tweets_metrics)

365

In [50]:
tweets_metrics.head()

            comment_num
day_date
2019-01-01           64
2019-01-02         1450
2019-01-03         3096
2019-01-04         1058
2019-01-05          140

In [51]:
total_data = pd.merge(data,tweets_metrics,on=['day_date'])

In [52]:
total_data.head()

  ticker_symbol    day_date  close_value  ...  high_value  low_value  comment_num
0          AAPL  2019-12-31       293.65  ...      293.68   289.5200          199
1          AAPL  2019-12-30       291.52  ...      292.69   285.2200          334
2          AAPL  2019-12-27       289.80  ...      293.97   288.1200          152
3          AAPL  2019-12-26       289.91  ...      289.98   284.7000          258
4          AAPL  2019-12-24       284.27  ...      284.89   282.9197          142

[5 rows x 8 columns]

In [53]:
sorted = total_data.sort_values(by=['day_date'],ascending=True)
sorted = sorted.reset_index(drop=True)
sorted.head()

  ticker_symbol    day_date  close_value  ...  high_value  low_value  comment_num
0          AAPL  2019-01-01       157.74  ...    159.3600     156.48           64
1          AAPL  2019-01-02       157.92  ...    158.8500     154.23         1450
2          AAPL  2019-01-03       142.19  ...    145.7200     142.00         3096
3          AAPL  2019-01-04       148.26  ...    148.5499     143.80         1058
4          AAPL  2019-01-05       148.26  ...    148.5499     143.80          140

[5 rows x 8 columns]

In [54]:
cols = ['day_date','close_value','comment_num']
final_data = sorted[cols]
final_data.to_csv('apple.csv',index=True)

In [55]:
final_data

       day_date  close_value  comment_num
0    2019-01-01       157.74           64
1    2019-01-02       157.92         1450
2    2019-01-03       142.19         3096
3    2019-01-04       148.26         1058
4    2019-01-05       148.26          140
..          ...          ...          ...
360  2019-12-27       289.80          152
361  2019-12-28       289.80          113
362  2019-12-29       289.80           75
363  2019-12-30       291.52          334
364  2019-12-31       293.65          199

[365 rows x 3 columns]